cases/01_horizontalCapillaryRise/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    { 
	type		pressureInletOutletVelocity;
        value           uniform (0 0 0); //dummy value, not used

    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0); //dummy value, not used
    }

    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }

    top
    {
        type            slip;
    }

    bottom
    {
         type            partialSlip;
         valueFraction   uniform 0.333333333333;

    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
