cases/01_horizontalCapillaryRise/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            totalPressure;
	p0		uniform 0;
        value           uniform 0;	// dummy, this is not used for calculation
    }

    outlet
    {
        type            totalPressure;
	p0		uniform 0;
        value           uniform 0;
    }

    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
