cases/01_horizontalCapillaryRise/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     interFlow;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          1e-06;

writeControl    adjustableRunTime;

writeInterval   0.001;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  no;

maxCo           1;

maxAlphaCo      0.2;

maxCapillaryNum 5;

maxDeltaT       1;

libs            ( "libfvOptionArtificialViscousInterfaceForce.so" );

functions
{
    alphaVolume
    {
        enabled         true;
        type            volFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        fields          ( alpha.water );
        writeFields     no;
        writeControl    writeTime;
        regionType      all;
        operation       volIntegrate;
        log             true;
    }
    components1
    {
        type            components;
        libs            ( fieldFunctionObjects );
        field           U;
        enabled         true;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   100000;
    }
    minMaxU
    {
        type            fieldMinMax;
        libs            ( fieldFunctionObjects );
        writeToFile     yes;
        log             no;
        location        no;
        mode            component;
        fields          ( Ux Uz );
    }
    interfaceHeight1
    {
        type            interfaceHeight;
        libs            ( fieldFunctionObjects );
        locations       ( ( 0 0 0.000199999999999999 ) );
        alpha           alpha.water;
        liquid          true;
        direction       ( -1 0 0 );
        interpolationScheme cellPoint;
        writePrecision  8;
    }
}


// ************************************************************************* //
