cases/01_horizontalCapillaryRise/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
artificialViscousInterfaceForce1
{   
    type            artificialViscousInterfaceForce;
	selectionMode	all;
    fields          (U);			// where source is applied (U) 
    method          constant;		// viscosity calculation methods: constant, raessi
    value           0.9982e-2;		// specification of constant value, only used for "constant" method
    gradMethod      grad;       	// gradient calculation method: grad, snGrad

	// optional: smoothing, 2 different methods can be chosen.
    nSmoothingSteps 0;				// number of smoothing steps for filter field smoothing (default 0)
    smoothingCoeff  0;  			// smoothing coefficient for filter field smoothing (default 0)

}   

