cases/01_horizontalCapillaryRise/system/setAlphaFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setAlphaFieldDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



field           alpha.water;

// calc geom parameters
angleTop_deg		45.;	// for this method angle must be below 90 deg
angleBot_deg		45.;
width				0.0004;
height				0.0004;

angleTop #calc "$angleTop_deg / 180. * 3.1415927";
angleBot #calc "$angleTop_deg / 180. * 3.1415927";

r 		#calc "$width / (cos($angleTop) + cos($angleBot))";
zCyl  	#calc "$r * cos($angleBot)";
xCyl	#calc "$r + $height";




type            composedFunction;
mode            subtract;
composedFunction
{

     cylinder
     {
        type    cylinder;
		radius	$r;
		origin ($xCyl 0.0 $zCyl); 
		direction (0 1 0);
		scale -1;
     }

     plane
     {
        type    plane;
		origin ($xCyl 0.0 $zCyl); 
		normal (-1 0 0);
     }
}


// ************************************************************************* //
